disambr.src.org
#+title: NEDR - Named Entity Disambiguation in R
#+author: Stanislav A. Vlasov
#+email: stanislav.a.vlasov@gmail.com
# ------------------------------------------------------------------------------

#+PROPERTY: header-args:R :comments link  :session

Description: file:readme.org

* Make & Deploy
#+BEGIN_SRC emacs-lisp
  ;; tangle source code
  (org-babel-tangle)
  ;; run package deployment scripts
  (let ((org-confirm-babel-evaluate nil))
	(save-excursion
	  (org-babel-goto-named-src-block "document")
	  (org-babel-execute-src-block)))
#+END_SRC
** Package documentation
:PROPERTIES:
:ID:       org:g01ja7119ri0
:END:
#+BEGIN_SRC R :tangle R/disambr.r
  #' @details
  #' This package provides a framework for disambiguating named entities (e.g., authors in large bibliometric databases)
  #' 
  #' Package provides following main functions
  #' - disambr_read - reads WoS data
  #' - disambr_aev - implementation of the AEV algorithm (van den Akker et al., 2020) for Web of Science author disambiguation.
  #' 
  #' This is work in progress. Please, file an issues or suggestion if you have any.
  #' @keywords internal
  "_PACKAGE"
#+END_SRC
** Set .Rprofile (developer enviroment)
*** CRAN Packages
:PROPERTIES:
:ID:       org:ihcia7119ri0
:END:
#+BEGIN_SRC R :tangle .Rprofile
  ## --------------------------------------------------------------------------------
  ## First load default packages getOption("defaultPackages")
  ## Otherwise it will add it at the end which can mask some funcitons
  .First.sys()


  ## some packages installations read .Rprofile loops the install
  current_wd <- getwd()
  setwd("~/")

  ## --------------------------------------------------------------------------------
  ## Load or Install Packages
  ## --------------------------------------------------------------------------------
  for(pkg in c('devtools'
             , 'roxygen2'
             , 'xml2'
             , 'tibble'
             , 'stringi'
             , 'stringr'
             , 'stringdist'
             , 'digest'
             , 'magrittr'
             , 'lubridate'
             , 'plyr'
             , 'pipeR'
             , 'ggplot2'
             , 'pbapply'
             , 'microbenchmark'
             , 'data.table'
             , 'dplyr'))
      if(!require(pkg, character.only = TRUE)) {
          install.packages(pkg, repos = 'http://cloud.r-project.org')
          require(pkg, character.only = TRUE) }


  ## restore current working directore
  setwd(current_wd)

  ## --------------------------------------------------------------------------------
  library(disambr)

  ## update.packages(ask = FALSE, repos = 'http://cloud.r-project.org')

#+END_SRC
*** My Packages
:PROPERTIES:
:ID:       org:hzuia7119ri0
:END:
#+BEGIN_SRC R :results silent :session :tangle no
  ## --------------------------------------------------------------------------------
  ## Load My pakcages
  ## --------------------------------------------------------------------------------
  ## detach(package:romRDS, unload = TRUE)
  ## remove.packages("romRDS")
  if (!require("romRDS", character.only = TRUE)) {
    if(!require("devtools")) {
      install.packages("devtools"
                     , repos = 'http://cloud.r-project.org'
                     , dependencies = TRUE)
      require("devtools", character.only = TRUE)
    }
    install_github("stasvlasov/romRDS")
    require("romRDS", character.only = TRUE)
  }
  ## --------------------------------------------------------------------------------
#+END_SRC
** Set up package
#+name: document
#+BEGIN_SRC R :results none :tangle no

  .First.sys()

  ## --------------------------------------------------------------------------------
  ## Load or Install Packages
  ## --------------------------------------------------------------------------------
  for(pkg in c('devtools'
             , 'roxygen2'
             , 'xml2'
             , 'tibble'
             , 'stringi'
             , 'stringr'
             , 'stringdist'
             , 'digest'
             , 'magrittr'
             , 'lubridate'
             , 'plyr'
             , 'pipeR'
             , 'ggplot2'
             , 'microbenchmark'
             , 'data.table'
             , 'dplyr'))
    if(!require(pkg, character.only = TRUE)) {
      install.packages(pkg, repos = 'http://cloud.r-project.org')
      require(pkg, character.only = TRUE)
    }
  ## --------------------------------------------------------------------------------

  ## Describint package
  ## --------------------------------------------------------------------------------

  ## Include packages:
  package.packages <- c(
      "data.table"
    , "magrittr"
    , "stringi"
    , "stringr"
    , "tibble"
    , "xml2"
    , "dplyr")

  ## Print current packages verstions
  ## package.packages %>%
  ##     sapply(function(pkg)
  ##     paste0(pkg, " (>= ", packageVersion(pkg), ")"), USE.NAMES = FALSE) %>%
  ##     cat(sep = "\n")

  ## Adjust verstions manually
  package.packages.man.ver  <- c(
      "data.table (>= 1.12)"
    , "magrittr (>= 1.5)"
    , "stringi (>= 1.4)"
    , "stringr (>= 1.4)"
    , "dplyr (>= 0.8)"
    , "tibble (>= 2.0)"
    , "xml2 (>= 1.0)"
  )

  ## make description
  list(Package = "disambr"
     , Title  = "disambr - Named Entity Disambiguation in R"
     , Description = "disambr - Named Entity Disambiguation in R"
     , `Authors@R` = c(person(given = c("Stanislav" ,"A.") , family = "Vlasov"
                     , email = "stanislav.a.vlasov@gmail.com"
                     , role = c("aut", "cre"))
              , person(given = c("Olmo", "R."), family = "van den Akker"
                     , email = "ovdakker@gmail.com"
                     , role = "aut")
              , person(given = "Sacha", family = "Epskamp"
                     , email = "sacha.epskamp@gmail.com"
                     , role = "aut"))
     , Imports = paste(package.packages.man.ver
                     , collapse = ", ")
     , Depends = "R (>= 3.4)"
     , Version = "0.1"
     , Date = Sys.Date()
     , URL = "https://github.com/stasvlasov/disambr"
     , BugReports = "https://github.com/stasvlasov/disambr/issues"
     , References = "This research was supported (in part) by the Fetzer Franklin Fund of the John E. Fetzer Memorial Trust.\n\nvan den Akker, O. R., Epskamp, Sacha, & Vlasov, S. A. (2020). The AEV Algorithm—Author name disambiguation for large Web of Science datasets."
           ) %>% use_description()

  use_lgpl_license(name = "Stanislav Vlasov")

  use_tidy_description()

  ## ----------------------------------------------------------------------------
  ## Update name spaces and documentation for functions
  roxygenise()


  ## This function is a wrapper for the ‘roxygen2::roxygenize()’ but also load the package
  ## document()

  ## ----------------------------------------------------------------------------
  ## Set up TestThat
  usethis::use_testthat()
#+END_SRC
** Deploy package
#+BEGIN_SRC R :tangle no
  ## Deploy
  ## --------------------------------------------------------------------------------
  install(".")

  install_github("stasvlasov/disambr")

  ## Test
  ## --------------------------------------------------------------------------------
  library("disambr")

  ## Remove
  ## --------------------------------------------------------------------------------
  detach(package:and, unload = TRUE)
  remove.packages("disambr")


  ## Just loadding
  ## --------------------------------------------------------------------------------

#+END_SRC

#+BEGIN_SRC R :tangle no
  source("R/disambr_utils.r")
  source("R/disambr_read.r")
  source("R/disambr_eva.r")
  source("R/disambr_sets.r")
#+END_SRC
* Functions
** disambr_utils
*** get_file_extension
:PROPERTIES:
:ID:       org:s6sdaz31gti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
  ##' Extention extractor. Same as tools::file_ext but for NULL input returns NULL instead of logical(0).
  ##' @param f file name 
  ##' @return extention
  ##' 
  ##' @importFrom magrittr %>%
  ##' @export 
  get_file_extension <- function(f) {
      if(length(f) == 1) {
          if(is.character(f)) {
              f %>% basename %>% 
                  stringi::stri_split_fixed(".") %>% 
                  extract2(1) %>%
                  extract(ifelse(length(.) == 1, NA, length(.))) %>%
                  ifelse(is.na(.), "", .)
          } else if(is.na(f)) {
              NA
          }
      } else {
          NULL
      }
  }

  ## my.file <- '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt' 
  ## my.file1 <- "/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments/LN Public NAICS records from 10001 to 10500.txt"

  ## get_file_extension(my.file)
  ## get_file_extension(my.file1)
  ## get_file_extension("sdfsdf....")
  ## get_file_extension("sdf")
  ## get_file_extension("")
  ## get_file_extension(NULL)
  ## get_file_extension(NA)
  ## get_file_extension("...sdf...sdf.df...sd.")
  ## get_file_extension(".")
  ## get_file_extension(".....")

  ## build in
  ## tools::file_ext(my.file)
  ## tools::file_ext(my.file1)
  ## tools::file_ext("sdfsdf....")
  ## tools::file_ext("sdf")
  ## tools::file_ext("")
  ## tools::file_ext(NULL)
  ## tools::file_ext(NA)
  ## tools::file_ext("...sdf...sdf.df...sd.")
  ## tools::file_ext(".")
  ## tools::file_ext(".....")
#+END_SRC
*** stop_unless
:PROPERTIES:
:ID:       org:ptydaz31gti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
  ##' Stops process unless cond is true
  ##' @param cond condition to test
  ##' @param message_if_false message_if_false
  ##' @param stop_if_false stop_if_false 
  ##' @param return_if_true return_if_true
  ##' @param return_if_false return_if_false 
  ##' @return 
  ##' 
  ##' @export 
  stop_unless <- function(cond
                        , message_if_false = paste("cond in not TRUE")
                        , stop_if_false = TRUE
                        , return_if_true = TRUE
                        , return_if_false = isFALSE(return_if_true)) {
      if(isTRUE(cond)) {
          return(return_if_true)
      } else if(isTRUE(stop_if_false)){
          stop(message_if_false, call. = FALSE)
      } else {
          warning(message_if_false, call. = FALSE)
          return(return_if_false)
      }
  }
#+END_SRC
*** parse_files_path
:PROPERTIES:
:ID:       org:kb3eaz31gti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
##' Returns vector of file paths from path(s) recursively
  ##' @param files_path Path(s) where the files are
  ##' @param recursive Whether to look in subfolders recursively
  ##' @return Vector of file paths from path(s) recursively
  ##' 
  ##' @md
  ##' @importFrom magrittr %>%
  ##' @export 
  parse_files_path <- function(files_path, recursive = TRUE) {
      stop_unless(is.character(files_path), "Files path shoud be a character string!")
      files_path <- 
      lapply(files_path, function(file.path) {
          if(stop_unless(file.exists(file.path)
                       , paste(file.path, " - does not exist!")
                       , stop_if_false = FALSE
                       , return_if_true = FALSE)) {
              NULL
          } else if(dir.exists(file.path)) {
              dir(file.path
                , full.names = TRUE
                , recursive = recursive)
          } else {
              file.path
          }
      })
      return(unique(normalizePath(unlist(files_path))))
  }
#+END_SRC



*** read_to_utf8
:PROPERTIES:
:ID:       org:wx7eaz31gti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
read_to_utf8 <- function(f, bytes_to_check = 2^14) {
    ## read file as raw bytes (not to Assume any encodings)
    bin <- readBin(f, raw(), n = file.size(f))
    ## check first 2^14 bytes for encoding
    encoding <- stringi::stri_enc_detect2(bin[1:bytes_to_check])[[1]][[1]][1]
    if(is.na(encoding)) {
        message("Could not detect encoding of file: ", f)
        s <- rawToChar(bin, multiple = FALSE)
    } else if(!(encoding %in% iconvlist())) {
        message("Does not know how to convert from ", encoding, "for file: ", f)
    } else if(encoding == "UTF8") {
        s <- rawToChar(bin, multiple = FALSE)
    } else {
        ## message("Converting to utf-8")
        s <- iconv(list(NULL, bin), from = encoding, to = "UTF-8")
    }
    return(s)
}

## stringi::stri_enc_detect2(NULL)[[1]][[1]][1]
## stringi::stri_enc_detect2(NA)[[1]][[1]][1]
## stringi::stri_enc_detect2(123)[[1]][[1]][1]
## stringi::stri_enc_detect2("")[[1]][[1]][1]
## stringi::stri_enc_detect2("sadf")[[1]][[1]][1]

#+END_SRC


*** recode_return_characters
:PROPERTIES:
:ID:       org:xbceaz31gti0
:END:
#+BEGIN_SRC R :tangle R/disambr_utils.r
recode_return_characters <- function(s, assoc.file = NA, verbose = FALSE) {
    has_return_chars <- function(s, test.first.n.char = 10^4) {
        s <- stri_sub(s, to = test.first.n.char)
        any(stri_detect_regex(s, "\\r"))
    }
    if(has_return_chars(s)) {
        if(verbose) message("'\\r' characters in the file: ", assoc.file
                          , "\n Removing to fix 'datatable::fread'")
        s <- stri_replace_all_regex(s, "\\R+", "\n")
    }
    return(s)
}
#+END_SRC


*** disambr_cbind_lists
#+BEGIN_SRC R :tangle no
##' Makes list of each element of l
##' @param l sequence or list
##' @param l.name same name will be applies to each element
##' @return list of lists
##' 
##' @export 
disambr_listify_list <- function(l, l.name = NULL) {
    if(isTRUE(l.name == "")) l.name =  NULL
    ## case when all are 1 length (vector or list of single length elements)
    lapply(l, function(x) {
        x <- list(x)
        names(x) <- l.name
        return(x)
    })
}


##' cbinds lists and names each element as name of each list in ...
##' @param ... Lists to cbin
##' @return Lists
##' @export 
disambr_cbind_lists <- function(...) {
    lists <- eval(...)
    lists_n <- length(lists)
    lists_names <- names(lists)
    cbind_list <- disambr_listify_list(lists[[1]], lists_names[1])
    for (i in 2:lists_n) {
        cbind_list <- 
            mapply(c
                 , cbind_list
                 , disambr_listify_list(lists[[i]], lists_names[i])
                 , SIMPLIFY = FALSE)
    }
    return(cbind_list)
}

#+END_SRC

