R/disambr.r
## [[id:org:g01ja7119ri0][Package documentation:1]]
#' @details
#' This package provides a framework for disambiguating named entities (e.g., authors in large bibliometric databases)
#' 
#' Package provides following main functions
#' - disambr_read - reads WoS data
#' - disambr_aev - implementation of the AEV algorithm (van den Akker et al., 2020) for Web of Science author disambiguation.
#' 
#' This is work in progress. Please, file an issues or suggestion if you have any.
#' @keywords internal
"_PACKAGE"
## Package documentation:1 ends here
