R/disambr_read.r
## disambr_eject:1 ends here

## [[id:org:1p6ja7119ri0][disambr_read:1]]
disambr_rbind_wos <- function(tables_list, tables_recipes) {
    publication_table <-
        data.table::rbindlist(tables_list, fill=TRUE)
    ## set publication attributes
    publication_table <-
        disambr_set_attributes(publication_table
                             , disambr_entity = "publication"
                             , disambr_entity_id_reference = "self"
                             , disambr_set_type = "different_entities"
                             , disambr_set_coefficient = 1
                             , disambr_set_name = "wos_records_tsv_export"
                             , disambr_set_collection = "single_set_table")
    ## add files recipies
    attributes(publication_table)$disambr_recipe <- tables_recipes
    return(publication_table)
}




disambr_process_files_data <- function(files_data_list, verbose = FALSE) {
    ## TODO: add other data processing here
    ## TODO: add processing of wos data with differen headers
    ## check wos publication
    processabe_data <-
        disambr_subsets(files_data_list
                      , list(disambr_set_name = "wos_records_tsv_export"))
    if (length(processabe_data) != 0) {
        processabe_data_recipes <-
            lapply(processabe_data, attr, "disambr_recipe")
        processabe_data_headers <-
            lapply(processabe_data_recipes, `[[`, "file_header")
        ## check if all headers ate the same before rbindlist
        if (length(unique(processabe_data_headers)) == 1) {
            message("disambr: processing wos tsv export data..")
            message("- rbinding wos tables..")
            wos_publication <-
                disambr_rbind_wos(files_data_list, processabe_data_recipes)
            message("- ejecting wos authors..")
            wos_author <- disambr_eject_authors(wos_publication, verbose = TRUE)
            ## remove fields that we do not need
            remove_headers <- c("AU", "AF", "C1", "RP", "EM", "RI", "OI")
            ## filter those that exists
            remove_headers <-
                remove_headers[remove_headers %in% processabe_data_headers[[1]]]
            ## remove headers without hard copy (to use a varialbe it should be in () )
            wos_publication[, (remove_headers) := NULL]
            message("- ejecting wos references..")
            wos_reference <- disambr_eject_references(wos_publication)
            ## remove fields that we do not need
            remove_headers <- c("CR")
            ## filter those that exists
            remove_headers <-
                remove_headers[remove_headers %in% processabe_data_headers[[1]]]
            ## remove headers without hard copy (to use a varialbe it should be in () )
            wos_publication[, (remove_headers) := NULL]
            ## if all data is wos data return only that
            if(length(processabe_data) == length(files_data_list)) {
                return(list(wos_publication
                          , wos_author
                          , wos_reference
                            ))
            } else {
                return(list(
                    disambr_subsets(files_data_list
                                  , list(disambr_set_name = "wos_records_tsv_export")
                                  , negate_subsets = TRUE)
                  , wos_publication
                  , wos_author
                  , wos_reference
                ))
            }
        } else {
            message("disambr: Files data has different headers. Skipping processing...")
            return(files_data_list)
        }
    } else {
        return(files_data_list)
    }
}

parse_tsv_wos_header <- function(first_line) {
    header <- stri_split_fixed(first_line, "\t")[[1]]
    if( ## check if at least 10 fields two big letters
        sum(stri_detect_regex(header, "^[A-Z0-9]{2}$")) > 10 &&
        ## check if main fields are present
        all(c('AU', 'TI') %in% header)) {
        stri_extract_first_regex(header, "[A-Z0-9]{2}")
    } else {FALSE}
}


disambr_read_tsv_wos <- function(f, header) {
    s <- read_to_utf8(f)
    s <- recode_return_characters(s, f)
    f_data <- fread(text = s
                  , skip = 1
                  , strip.white = TRUE
                  , header = FALSE
                  , col.names = header
                  , select = 1:length(header)
                    ## , colClasses = rep("character", length(header))
                  , quote=""
                  , keepLeadingZeros = FALSE
                  , encoding = "UTF-8"
                  , sep = "\t")
    ## set attrib (file, funcall, meanning of the fields and data scheme)
    ## TODO: this also can be a separate function to set atribute to data
    attributes(f_data)$disambr_entity <- "publication"
    attributes(f_data)$disambr_entity_id_reference <- "self"
    attributes(f_data)$disambr_set_type <- "different_entities"
    attributes(f_data)$disambr_set_coefficient <- 1
    attributes(f_data)$disambr_set_name <- "wos_records_tsv_export"
    attributes(f_data)$disambr_set_collection <- "single_set_table"
    attributes(f_data)$disambr_recipe <-
                         list(procedure = "disambr_read_tsv_wos"
                            , file_name = f
                            , file_md5sum = tools::md5sum(f)
                            , file_header = header
                            , procedure = "disambr_read_tsv_wos")
    return(f_data)
}


disambr_read_tsv <- function(f) {
    ## check tsv file type base on first line
    first_line <- readLines(f, n = 1
                          , warn = FALSE
                          , skipNul = TRUE)
    header <- parse_tsv_wos_header(first_line)
    if(!isFALSE(header)) {
        disambr_read_tsv_wos(f, header)
    } else {
        ## here we can add more tsv types
        message("Disambr: unrecognized header of tsv file: ", header
              , "\n  - skipping file: ", f)
        NULL
    }
}

disambr_read_file <- function(f) {
    f_extention <- tools::file_ext(f)
    switch(f_extention
         , "tsv" = disambr_read_tsv(f)
           ## here we can add reading from .txt wos files
         , "txt" = disambr_read_tsv(f)
         , message("Disambr: can not read file extention: ", f_extention
                 , "\n  - skipping file: ", f))
}

##' Reads the data for disambiguation
##' @param files_path Path to data. You can specify almost everything
##' @inheritDotParams 
##' @return 
##' 
##' @md 
##' @export 
disambr_read <- function(files_path) {
    files_path <- parse_files_path(files_path)
    files_data_list <- lapply(files_path, disambr_read_file)
    sets <- disambr_process_files_data(files_data_list)
    return(sets)
}



## my.dir <- '../data'
## my.dir.small <- '../data/Journals in Mathematical Psychology'
## my.dir.large <- '/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments'
## my.dir.huge <- '/mnt/md5/data/wos'


## my.file <- '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt' 
## my.file1 <- "/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments/LN Public NAICS records from 10001 to 10500.txt"
## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
## my.files <-
## c('../data/Journals in Mathematical Psychology/Applied Measurement in Education.txt'
## , '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt')


## dt <- my.dir.small %>% disambr_read
## dt %>% length
## disambr_read:1 ends here
