R/disambr_eva.r
## [[id:org:8c83hcq0hti0][disambr_set_tekles_bornmann:1]]
disambr_set_tekles_bornmann <- function(sets
                                      , file_path = "../data/tekles_bornmann_rids.txt"
                                      , verbose = FALSE
                                      , save_set_as = TRUE
                                      , data_set_name = 
                                      "wos_records_tsv_export_author_table") {
    if(verbose) message("disambr: Starting disambr_set_tekles_bornmann...")
    if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
    data_set <-
        disambr_subsets(sets
                      , list(disambr_set_name = data_set_name)
                      , which_to_return = "first")
    sets <- disambr_subsets(sets
                      , list(disambr_set_name = data_set_name)
                      , negate_subsets = TRUE)
    if(verbose) message("- filtering authors from Tekles & Bornmann (2019)")
    researcher_ids <- readLines(file_path)
    data_set <- data_set[author_researcher_id %in% researcher_ids]
    data_set_recipe <- attr(data_set, "disambr_recipe")
    data_set <-
        disambr_set_attributes(data_set
                             , disambr_recipe = c(list("disambr_set_tekles_bornmann")
                                                , data_set_recipe))
    disambr_save_set(data_set, save_set_as)
    return(c(sets, list(data_set)))
 }

## dt <- readRDS(file = "my.dir.wos.rds") %>%
    ## disambr_set_tekles_bornmann(verbose = TRUE) %>%
    ## disambr_set_on_same_paper(verbose = TRUE, save_set_as = TRUE)


## dt %>% length
## dt[[4]] %>% head


## after disambr_set_tekles_bornmann
## dt %>% length
## nrow(dt[[3]])
## 25868 vs 834090
## disambr_set_tekles_bornmann:1 ends here

## [[id:org:iab3hcq0hti0][disambr_set_on_same_paper:1]]
disambr_set_on_same_paper <- function(sets
                                      , verbose = FALSE
                                      , save_set_as = TRUE
                                      , data_set_name =
                                            "wos_records_tsv_export_author_table") {
    if(verbose) message("disambr: Starting disambr_set_not_on_same_paper...")
    if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
    data_set <-
        disambr_subsets(sets
                      , list(disambr_set_name = data_set_name)
                      , which_to_return = "first")
    if(verbose) message("- spliting co-authors")
    return_sets <- data_set %>% {split(1:nrow(.), .$paper_id)}
    data_set_recipe <- attr(data_set, "disambr_recipe")
    return_sets <- 
           disambr_set_attributes(return_sets
                         , disambr_entity = "person"
                         , disambr_set_type = "different"
                         , disambr_set_coefficient = 1
                         , disambr_set_name = "on_same_paper"
                         , disambr_set_collection = "sets_list"
                         , disambr_entity_id_reference =
                               "wos_records_tsv_export_author_table"
                         , disambr_recipe = c(list("disambr_set_on_same_paper")
                                            , data_set_recipe))
    disambr_save_set(return_sets, save_set_as)
    return(c(sets, list(return_sets)))
}
## disambr_set_on_same_paper:1 ends here

## [[id:org:nie3hcq0hti0][disambr_set_not_on_same_paper:1]]
## too slow... and eats all ram
disambr_set_not_on_same_paper <- function(sets
                                        , verbose = FALSE
                                        , save_set_as = TRUE
                                        , data_set_name =
                                              "wos_records_tsv_export_author_table") {
     if(verbose) message("disambr: Starting disambr_set_not_on_same_paper...")
     if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
     data_set <-
         disambr_subsets(sets
                       , list(disambr_set_name = data_set_name)
                       , which_to_return = "first")
     if(verbose) message("- spliting co-authors")
     return_sets <- data_set %>% {split(1:nrow(.), .$paper_id)}
     if(verbose) message("- making combinations of co-authors sets..")
     if(length(return_sets) > 50000) stop("--- THE NUMBER OF COMBINATIONS IS TO HIGH!")
     return_sets_comb <-
         combn(length(return_sets), 2, simplify = FALSE)
     if(verbose) message("--- made ,", length(return_sets_comb), " combinations")
     if(verbose) message("- expanding combinations")
     return_sets <-
         pblapply(return_sets_comb
                , function(comb) {
                    expand.grid(author_id1 = return_sets[[comb[1]]]
                              , author_id2 = return_sets[[comb[2]]])
                })
     if(verbose) message("- rbinding combinations..")
     return_sets <- data.table::rbindlist(return_sets)
     if(verbose) message("--- rbinded into ", nrow(return_sets), " rows")
