disambr.src.org
*** disambr_set_similar_initials
:PROPERTIES:
:ID:       org:i1i3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  disambr_set_similar_initials <- function(sets
                                         , verbose = FALSE
                                         , save_set_as = TRUE
                                         , data_set_name =
                                               "wos_records_tsv_export_author_table"
                                         , input_set_name = "on_same_paper") {
      if(verbose) message("disambr: Starting disambr_set_similar_initials...")
      if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
      data_set <-
          disambr_subsets(sets
                        , list(disambr_set_name = data_set_name)
                        , which_to_return = "first")
      input_set <-
          disambr_subsets(sets
                        , list(disambr_set_name = data_set_name)
                        , which_to_return = "first")
      ## sets <- disambr_subsets(sets
      ##                       , list(disambr_set_name = data_set_name)
      ##                       , negate_subsets = TRUE)
      if(verbose) message("- doing combinations")
      input_set_l <- length(input_set)
      return_set <- 
          pblapply(1:input_set_l, function(i) {
              comb <- lapply((i+1):input_set_l
                           , function(j) {
                               expand.grid(author_id1 = input_set[[i]]
                                         , author_id2 = input_set[[j]])
                           })
              comb <- data.table::rbindlist(comb)
              comb_dist <- stringdist(data_set$author_initials[comb$author_id1]
                                    , data_set$author_initials[comb$author_id2]
                                    , method = "lv")
              return(comb[comb_dist < 2])
          })
      if(verbose) message("- rbinding dyads")
      return_set <- data.table::rbindlist(return_set)
      input_set_recipe <- attr(data_set, "disambr_recipe")
      return_set <-
          disambr_set_attributes(
              return_sets
            , disambr_entity = "person"
            , disambr_set_type = "similar"
            , disambr_set_coefficient = 0.5
            , disambr_set_name = "similar_initials"
            , disambr_set_collection = "dyads_table"
            , disambr_entity_id_reference =
                  "wos_records_tsv_export_author_table"
            , disambr_recipe = c(list("disambr_set_set_similar_initials")
                               , input_set_recipe))
      disambr_save_set(return_sets, save_set_as)
      return(c(sets, list(return_set)))
   }


    ## dt <- readRDS(file = "my.dir.wos.rds") %>%
        ## disambr_set_tekles_bornmann(verbose = TRUE) %>%
        ## disambr_set_on_same_paper(verbose = TRUE, save_set_as = TRUE) %>% 
        ## disambr_set_similar_initials(verbose = TRUE)
#+END_SRC


*** disambr_set_similar_last_names
:PROPERTIES:
:ID:       org:nnl3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  disambr_set_similar_last_names <- function(sets
                                           , verbose = FALSE
                                           , save_set_as = TRUE
                                           , data_set_name =
                                                 "wos_records_tsv_export_author_table"
                                           , input_set_name = "on_same_paper") {
      if(verbose) message("disambr: Starting disambr_set_similar_last_names...")
      if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
      data_set <-
          disambr_subsets(sets
                        , list(disambr_set_name = data_set_name)
                        , which_to_return = "first")
      input_set <-
          disambr_subsets(sets
                        , list(disambr_set_name = input_set_name)
                        , which_to_return = "first")
      input_set_l <- length(input_set)
      if(verbose) message("- doing combinations on ", input_set_l)
      return_set <- 
          pblapply(1:input_set_l, function(i) {
              comb <- lapply((i+1):input_set_l
                           , function(j) {
                               expand.grid(author_id1 = input_set[[i]]
                                         , author_id2 = input_set[[j]])
                           })
              comb <- data.table::rbindlist(comb)
              comb_dist <- stringdist(data_set$author_last_name[comb$author_id1]
                                    , data_set$author_last_name[comb$author_id2]
                                    , method = "dl")
              return(comb[comb_dist < 2])
          })
      if(verbose) message("- rbinding dyads")
      return_set <- data.table::rbindlist(return_set)
      input_set_recipe <- attr(data_set, "disambr_recipe")
      return_set <-
          disambr_set_attributes(
              return_sets
            , disambr_entity = "person"
            , disambr_set_type = "similar"
            , disambr_set_coefficient = 0.5
            , disambr_set_name = "similar_last_names"
            , disambr_set_collection = "dyads_table"
            , disambr_entity_id_reference =
                  "wos_records_tsv_export_author_table"
            , disambr_recipe = c(list("disambr_set_similar_last_names")
                               , input_set_recipe))
      disambr_save_set(return_sets, save_set_as)
      return(c(sets, list(return_set)))
   }


    ## dt <- readRDS(file = "my.dir.wos.rds") %>%
        ## disambr_set_tekles_bornmann(verbose = TRUE) %>%
        ## disambr_set_on_same_paper(verbose = TRUE, save_set_as = TRUE) %>% 
        ## disambr_set_similar_last_names(verbose = TRUE)
#+END_SRC

** disambr_aev_depricated
*** disambr_set_co_authors                                     :depricated:
:PROPERTIES:
:ID:       org:2mo3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
##' Returns sets of people ids that are defenetely different based on co-authorship
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_set_co_authors <- function(sets, procedures = NULL) {
      message("disambr: Starting disambr_set_co_authors...")
      if(!is.list(sets)) stop("disambr: 'sets' parameter should be list!")
      disambr_subsets("person")
      focal.set <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          ## TODO: implement extraction from different data type
          extract2(1)
      new.set <- focal.set %>%
          {split(1:nrow(.), .$paper_id)}
      ## set set's attributes
      attributes(new.set)$disambr.set.unit <- "person.distinct"
      attributes(new.set)$disambr.set.unit.ref.md5 <- digest(focal.set, "md5")
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>% disambr_set_co_authors
  ## dt[[4]]


#+END_SRC
