disambr.src.org
*** disambr_get_3_refs_common                                  :depricated:
:PROPERTIES:
:ID:       org:amr3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r

  ##' Returns set of people with save email addresses
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_3_refs_common <- function(sets, procedures = NULL) {
      message("Starting disambr_get_3_refs_common...")
      ## TODO: extract teh set that we need here (person, dyads)
      similar.last.names <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "similar.last.names") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      new.set <-
          similar.last.names %>% 
          dplyr::mutate(same.affiliations =
                            mapply(function(var1, var2)
                                any(set.data$author_affiliations[var1] %in% 
                                    set.data$author_affiliations[var2])
                            , Var1, Var2))
      ## new.set <- dplyr::filter(new.set, last.name.dist < 2)
      attributes(new.set)$disambr.set.unit <- "same.affiliation"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials %>%
      ## disambr_get_similar_last_names %>% 
      ## disambr_get_same_affiliation
  ## dt[[7]]$same.affiliations
#+END_SRC

*** disambr_get_same_affiliation                               :depricated:
:PROPERTIES:
:ID:       org:nqu3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  ##' Returns set of people with save email addresses
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_same_affiliation <- function(sets, procedures = NULL) {
      message("Starting disambr_get_same_affiliation...")
      ## TODO: extract teh set that we need here (person, dyads)
      similar.last.names <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "similar.last.names") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      new.set <-
          similar.last.names %>% 
          dplyr::mutate(same.affiliations =
                            mapply(function(var1, var2)
                                any(set.data$author_affiliations[var1] %in% 
                                    set.data$author_affiliations[var2])
                            , Var1, Var2))
      ## new.set <- dplyr::filter(new.set, last.name.dist < 2)
      attributes(new.set)$disambr.set.unit <- "same.affiliation"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials %>%
      ## disambr_get_similar_last_names %>% 
      ## disambr_get_same_affiliation
  ## dt[[7]]$same.affiliations
#+END_SRC

*** disambr_get_same_coauthor                                  :depricated:
:PROPERTIES:
:ID:       org:hwx3hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  ##' Returns set of people with save email addresses
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_same_coauthor <- function(sets, procedures = NULL) {
      message("Starting disambr_get_same_email...")
      ## TODO: extract teh set that we need here (person, dyads)
      similar.last.names <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "similar.last.names") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      fun <- function(var1, var2) {
          any(set.data[paper_id %in% paper_id[var1] &
                       !(author_name %in% author_name[var1])]$author_name %in% 
              set.data[paper_id %in% paper_id[var2] &
                       !(author_name %in% author_name[var2])]$author_name)
      }
      new.set <-
          similar.last.names %>% 
          dplyr::mutate(
                     same.co.author = mapply(fun, Var1, Var2))
      ## new.set <- dplyr::filter(new.set, last.name.dist < 2)
      attributes(new.set)$disambr.set.unit <- "same.email"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials %>%
      ## disambr_get_similar_last_names %>% 
      ## disambr_get_same_coauthor

  ## dt[[7]]
#+END_SRC


*** disambr_get_similar_last_names                             :depricated:
:PROPERTIES:
:ID:       org:y114hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  ##' Returns set of people with similar last names
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_similar_last_names <- function(sets, procedures = NULL) {
      message("Starting disambr_get_similar_last_names...")
      ## TODO: extract teh set that we need here (person, dyads)
      set.similar.initials <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "similar.initials") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      new.set <-
          dplyr::mutate(
                     set.similar.initials
                   , last.name.dist =
                         stringdist(set.data$author_last_name[Var1]
                                  , set.data$author_last_name[Var2]
                                  , method = "dl"))
      new.set <- dplyr::filter(new.set, last.name.dist < 2)
      attributes(new.set)$disambr.set.unit <- "similar.last.names"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials %>%
      ## disambr_get_similar_last_names
  ## dt[[6]]
#+END_SRC

*** disambr_get_same_email                                     :depricated:
:PROPERTIES:
:ID:       org:e544hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  ##' Returns set of people with save email addresses
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_same_email <- function(sets, procedures = NULL) {
      message("Starting disambr_get_same_email...")
      ## TODO: extract teh set that we need here (person, dyads)
      similar.last.names <- sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "similar.last.names") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      new.set <-
          similar.last.names %>% 
          dplyr::mutate(same.email = mapply(function(var1, var2)
                            set.data$author_email[var1] == set.data$author_email[var2]
                            , Var1, Var2))
      ## new.set <- dplyr::filter(new.set, last.name.dist < 2)
      attributes(new.set)$disambr.set.unit <- "same.email"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials %>%
      ## disambr_get_similar_last_names %>% 
      ## disambr_get_same_email
#+END_SRC




