disambr.src.org
*** disambr_get_similar_initials                               :depricated:
:PROPERTIES:
:ID:       org:lk74hcq0hti0
:END:
#+BEGIN_SRC R :tangle R/disambr_eva.r
  ##' Returns set of people with similar initials
  ##' @param sets 
  ##' @param procedures 
  ##' @inheritDotParams 
  ##' @return 
  ##' 
  ##' @md 
  ##' @importFrom magrittr %>%
  ##' @import magrittr data.table dplyr stringr
  ##' @export 
  disambr_get_similar_initials <- function(sets, procedures = NULL) {
      message("Starting disambr_get_similar_initials...")
      ## sapply(sets,attr, "disambr.set.unit")
      set.different.authors <-
          sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person.distinct") %>%
          extract2(1)
      set.data <-sets %>%
          extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
          extract2(1)
      ## procedurs
      subset.similar.initials <- function(comb) {
          a <- set.different.authors[[comb[1]]]
          b <- set.different.authors[[comb[2]]]
          expand.grid(a, b)
      }
      new.set <- combn(1:length(set.different.authors), 2
                     , simplify = FALSE
                       ## , FUN = subset.similar.initials
                       )
      message("...combn produced ", length(new.set), " pairs of pubs")
      new.set <- pblapply(new.set, subset.similar.initials)
      message("...subset.similar.initials is done")
      new.set <- data.table::rbindlist(new.set)
      message("...rbindlist produced ", nrow(new.set), " pairs")
      new.set <- dplyr::mutate(new.set
                             , initials.dist =
                                   stringdist(set.data$author_initials[Var1]
                                            , set.data$author_initials[Var2]
                                            , method = "lv"))
      new.set <- dplyr::filter(new.set, initials.dist < 2)
      attributes(new.set)$disambr.set.unit <- "similar.initials"
      return(c(sets, list(new.set)))
  }

  ## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  ## dt <- disambr_read(my.file2) %>%
      ## disambr_set_co_authors %>%
      ## disambr_get_similar_initials
  ## dt[[5]]

#+END_SRC

** tests

#+BEGIN_SRC R :results none :session :tangle no
  my.dir <- '../data'
  my.dir.small <- '../data/Journals in Mathematical Psychology'
  my.dir.large <- '/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments'
  my.dir.huge <- '/mnt/md5/data/wos'

  my.file <- '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt' 
  my.file1 <- "/mnt/md5/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments/LN Public NAICS records from 10001 to 10500.txt"
  my.files <-
      c('../data/Journals in Mathematical Psychology/Applied Measurement in Education.txt'
      , '../data/Journals in Mathematical Psychology/Applied Psychological Measurement.txt')


  ## ----------------------------------------------------------------------------

  my.dat <- disambr.read(my.dir)

  my.dat <- disambr.read(my.file)

  attributes(my.dat[[1]])

  my.dat <- disambr.read("../data/new_export")

  my.dat[[1]]$RP[1:4]
  my.dat[[1]]$EM[1:4]

  my.dat <- 
      my.dat %>%
      disambr.get.different.authors


  my.dat[[2]]


  my.dat %>% 
      disambr.get.different.authors %>% 
      disambr.get.similar.initials %>%
      disambr.get.similar.last.names


  dat <- disambr.read(my.file)

  dat %>% extract(1) %>% disambr.get.different.authors


  ## new testing
  d <- disambr.read("../data/wos-researchers-ids")

  d <- d[[1]][1:1000,] %>% list

  d.done <- 
      d %>% 
      disambr.get.different.authors %>% 
      disambr.get.similar.initials  %>%


  d.done %>% length

  d.done2 %>% length

  d.done2[[4]] %>% nrow

  d.done2 <- 
      d.done %>%
      disambr.get.similar.last.names

  saveRDS(d.done2, "../data/d.done2.rds")




  disambr.eva <- function(data) {
      data %>% 
          disambr.get.different.authors %>% 
          disambr.get.similar.initials %>%
          disambr.get.similar.last.names
  }

  ## Usage
  disambr.eva(data)


  disambr.get.different.authors <- disambr.define.procedure(data %>% 
                                                            get(publication) %>%
                                                            for.each %>%
                                                            get(person = author))

  ## or
  disambr.get.different.authors <- disambr.define.procedure(data$
                                                            publication$
                                                            person(author))





  list(data = my.dat
     , similar.initials = set.similar.initials) %>% 
      disambr.get.similar.last.names


  set.different.authors <- disambr.get.different.authors(my.dat)

  set.similar.initials <- 
      list(data = my.dat
         , different.authors = set.different.authors) %>% 
      disambr.get.similar.initials




  ## 2020-08-25

  ## problem with large integers
  bit64

  return_sets_comb <-
          combn(1:100000, 2, simplify = FALSE)

  10,000,000,000

  return_sets_comb %>% length

  install.packages("bit64")
  as.integer64
  library("bit64")

  .Machine$integer.max
  [1] 2147483647


  combn(3, 2, simplify = FALSE)

  my.dir.small <- '../data/Journals in Mathematical Psychology'

  my.dir.large <- '/run/media/stas/ed6193a5-e4fd-4d83-9eb6-e481c39aeb8f/data/wos/wos-sci-expanded.firm-names-query.analytical-instruments'


  my.dir.wos <- "~/home/web of science"

  my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
  my.file2 <- "../data/wos-researchers-ids"


  dt <- disambr_read(my.dir.wos) %T>%
      saveRDS(file = "my.dir.wos.rds", compress = FALSE)


  dt <- readRDS(file = "my.dir.wos.rds") %>% 
      disambr_set_not_on_same_paper(verbose = TRUE)



  dt <- disambr_read(my.dir.large) %T>%
      saveRDS(file = "my.dir.large.rds", compress = FALSE) %>% 
      disambr_set_not_on_same_paper(verbose = TRUE)

  dt <- readRDS(file = "my.dir.large.rds") %>% 
      disambr_set_not_on_same_paper(verbose = TRUE)

  dt[[4]]
#+END_SRC

Testing help

#+BEGIN_SRC R :results none :session :tangle no
  options(browser="firefox")
  help(disambr.read, help_type = "html")
#+END_SRC

** testthat
:PROPERTIES:
:ID:       org:w9t7lox0gti0
:END:

#+BEGIN_SRC R :results none :session :tangle tests/testthat/test.stop.unless.r :mkdirp yes
test_that("stop.unless", {
      expect_warning(stop.unless(FALSE, "Lala", FALSE))
      expect_error(stop.unless(FALSE))
      expect_true(stop.unless(TRUE))
      expect_false(stop.unless("sdfasdf", stop.if.false = FALSE))
      expect_true(stop.unless("sdfasdf", stop.if.false = FALSE, return.if.true = FALSE))
  })
#+END_SRC


#+BEGIN_SRC R :results none :session :tangle tests/testthat/test.parse.files.path.r :mkdirp yes
    test_that("parse.files.path", {
          expect_error(parse.files.path(3423))
          expect_warning(parse.files.path(c(".", "gibirish file")))
          expect_is(parse.files.path("."), "character")
          ## empty dirs
          tmp.dir <- "test_dir_for_parse.files.path"
          dir.create(tmp.dir, showWarnings = FALSE)
          expect_equal(parse.files.path(tmp.dir), character(0))
          file.remove(tmp.dir)
      })
#+END_SRC

