R/disambr_eva.r
    ## new.set <- dplyr::filter(new.set, last.name.dist < 2)
    attributes(new.set)$disambr.set.unit <- "same.email"
    return(c(sets, list(new.set)))
}

## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
## dt <- disambr_read(my.file2) %>%
    ## disambr_set_co_authors %>%
    ## disambr_get_similar_initials %>%
    ## disambr_get_similar_last_names %>% 
    ## disambr_get_same_email
## disambr_get_same_email:1 ends here

## [[id:org:lk74hcq0hti0][disambr_get_similar_initials:1]]
##' Returns set of people with similar initials
##' @param sets 
##' @param procedures 
##' @inheritDotParams 
##' @return 
##' 
##' @md 
##' @importFrom magrittr %>%
##' @import magrittr data.table dplyr stringr
##' @export 
disambr_get_similar_initials <- function(sets, procedures = NULL) {
    message("Starting disambr_get_similar_initials...")
    ## sapply(sets,attr, "disambr.set.unit")
    set.different.authors <-
        sets %>%
        extract(sapply(.,attr, "disambr.set.unit") == "person.distinct") %>%
        extract2(1)
    set.data <-sets %>%
        extract(sapply(.,attr, "disambr.set.unit") == "person") %>%
        extract2(1)
    ## procedurs
    subset.similar.initials <- function(comb) {
        a <- set.different.authors[[comb[1]]]
        b <- set.different.authors[[comb[2]]]
        expand.grid(a, b)
    }
    new.set <- combn(1:length(set.different.authors), 2
                   , simplify = FALSE
                     ## , FUN = subset.similar.initials
                     )
    message("...combn produced ", length(new.set), " pairs of pubs")
    new.set <- pblapply(new.set, subset.similar.initials)
    message("...subset.similar.initials is done")
    new.set <- data.table::rbindlist(new.set)
    message("...rbindlist produced ", nrow(new.set), " pairs")
    new.set <- dplyr::mutate(new.set
                           , initials.dist =
                                 stringdist(set.data$author_initials[Var1]
                                          , set.data$author_initials[Var2]
                                          , method = "lv"))
    new.set <- dplyr::filter(new.set, initials.dist < 2)
    attributes(new.set)$disambr.set.unit <- "similar.initials"
    return(c(sets, list(new.set)))
}

## my.file2 <- "../data/new_export/savedrecs-ms-recent.txt"
## dt <- disambr_read(my.file2) %>%
    ## disambr_set_co_authors %>%
    ## disambr_get_similar_initials
## dt[[5]]
## disambr_get_similar_initials:1 ends here
